todbot/circuitpython/ports/espressif/boards/pcbcupid_glyph_c6/mpconfigboard.h
#pragma once

#define MICROPY_HW_BOARD_NAME       "Pcbcupid GLYPH C6"
#define MICROPY_HW_MCU_NAME         "ESP32-C6"

#define MICROPY_HW_LED_STATUS       (&pin_GPIO14)

#define DEFAULT_UART_BUS_TX         (&pin_GPIO16)
#define DEFAULT_UART_BUS_RX         (&pin_GPIO17)

#define DEFAULT_I2C_BUS_SCL         (&pin_GPIO5)
#define DEFAULT_I2C_BUS_SDA         (&pin_GPIO4)

#define DEFAULT_SPI_BUS_SCK         (&pin_GPIO21)
#define DEFAULT_SPI_BUS_MOSI        (&pin_GPIO22)
#define DEFAULT_SPI_BUS_MISO        (&pin_GPIO23)

#define CIRCUITPY_BOOT_BUTTON       (&pin_GPIO9)
